In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser = Series(np.arange(3.))

data = DataFrame(np.arange(16).reshape(4,4),index=list('abcd'),columns=list('wxyz'))

data

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [4]:
data['w']  #选择表格中的'w'列，使用类字典属性,返回的是Series类型

a     0
b     4
c     8
d    12
Name: w, dtype: int64

In [5]:
data.w  #选择表格中的'w'列，使用点属性,返回的是Series类型

a     0
b     4
c     8
d    12
Name: w, dtype: int64

In [6]:
data[['w']]  #选择表格中的'w'列，返回的是DataFrame类型

    w
a   0
b   4
c   8
d  12

In [7]:
data[['w','z']]  #选择表格中的'w'、'z'列

    w   z
a   0   3
b   4   7
c   8  11
d  12  15

In [8]:
data[0:2]  #返回第1行到第2行的所有行，前闭后开，包括前不包括后

   w  x  y  z
a  0  1  2  3
b  4  5  6  7

In [9]:
data[1:2]  #返回第2行，从0计，返回的是单行，通过有前后值的索引形式，如果采用data[1]则报错

   w  x  y  z
b  4  5  6  7

In [10]:
data.iloc[1:2]  # for positional indexing

   w  x  y  z
b  4  5  6  7

In [11]:
data.loc['a']  # for label based indexing

w    0
x    1
y    2
z    3
Name: a, dtype: int64

In [12]:
data['a':'b']  #利用index值进行切片，返回的是**前闭后闭**的DataFrame，即末端是包含的

   w  x  y  z
a  0  1  2  3
b  4  5  6  7

In [13]:
data.head()  #返回data的前几行数据，默认为前五行，需要前十行则data.head(10)

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [14]:
data.tail()  #返回data的后几行数据，默认为后五行，需要后十行则data.tail(10)

    w   x   y   z
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [15]:
data.iloc[-1]   #选取DataFrame最后一行，返回的是Series

w    12
x    13
y    14
z    15
Name: d, dtype: int64

In [16]:
data.iloc[-1:]   #选取DataFrame最后一行，返回的是DataFrame

    w   x   y   z
d  12  13  14  15

In [17]:
data.loc['a',['w','x']]   #返回‘a’行'w'、'x'列，这种用于选取行索引列索引已知

w    0
x    1
Name: a, dtype: int64

In [18]:
data.iat[1,1]   #选取第二行第二列，用于已知行、列位置的选取

5

In [19]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [20]:
data = DataFrame(np.arange(15).reshape(3,5),index=['one','two','three'],columns=['a','b','c','d','e'])

In [21]:
data

        a   b   c   d   e
one     0   1   2   3   4
two     5   6   7   8   9
three  10  11  12  13  14

In [22]:
from pandas.io.parsers import read_csv

In [23]:
df = read_csv('./data/tencent_hr.csv')  #从CSV中读取

In [24]:
df

,work_place,work_type,work_time,work_count,work_name
0,北京,技术类,2017-12-20,1,MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1,北京,技术类,2017-12-20,1,WXG08-122 微信数据挖掘算法高级工程师（北京）
2,北京,技术类,2017-12-20,1,OMG097-测试开发工程师（北京）
3,北京,技术类,2017-12-20,2,OMG236-腾讯视频推荐算法高级工程师（北京）
4,北京,技术类,2017-12-20,1,23671-高级数据分析开发工程师(北京）
5,北京,技术类,2017-12-20,1,22090-天天快报-文本分析与挖掘高级工程师（北京）
6,北京,技术类,2017-12-20,1,WXG08-121 微信机器学习算法工程师（北京）
7,北京,技术类,2017-12-20,3,23674-腾讯新闻高级系统测试工程师
8,北京,技术类,2017-12-20,1,SA-腾讯社交广告高级系统测试工程师（北京）
9,北京,技术类,2017-12-19,2,22989-腾讯云高级后台开发工程师（北京）
10,北京,技术类,2017-12-19,2,22989-云计算研发工程师（北京）
11,北京,技术类,2017-12-19,3,22989-腾讯云高级后台开发(互联网业务)（北京）
12,北京,技术类,2017-12-19,1,OMG097-数据挖掘工程师(北京）
13,北京,技术类,2017-12-18,2,23674-搜索架构高级工程师
14,北京,产品/项目类,2017-12-18,1,22090-天天快报-数据产品组组长（北京）
15,北京,技术类,2017-12-19,3,TEG02-控制器研发工程师（北京）
16,北京,技术类,2017-12-19,1,22989-高级图像处理算法工程师（北京）
17,北京,技术类,2017-12-19,1,WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18,北京,技术类,2017-12-18,2,23674-新闻搜索算法高级工程师
19,北京,技术类,2017-12-18,1,OMG097-后台开发高级工程师(北京）
20,北京,技术类,2017-12-18,1,MIG03-数据评测工程师（北京）
21,北京,技术类,2017-12-16,2,OMG097-数据挖掘工程师(北京）
22,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
23,北京,技术类,2017-12-15,1,SA-腾讯社交广告联盟策略开发工程师（北京）
24,北京,技术类,2017-12-14,1,23048-内容推荐算法高级工程师（北京）
25,北京,技术类,2017-12-18,1,MIG16-地图专题数据后台开发工程师-功能方向（北京）
26,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
27,北京,技术类,2017-12-15,2,MIG16-地图数据高级后台工程师（北京）
28,北京,技术类,2017-12-14,1,TEG05-高级安全数据研究员(北京）
29,北京,技术类,2017-12-14,2,SA-腾讯社交广告算法工程师（质量研发中心 北京）
...,...,...,...,...,...
52,北京,技术类,2017-11-27,1,MIG16-地图导航后台开发工程师(北京)
53,北京,技术类,2017-11-26,1,23048-翻译君后台开发高级工程师（北京）
54,北京,技术类,2017-11-21,2,TEG03-高级算法研发工程师（深圳）
55,北京,技术类,2017-12-01,1,22989-云存储资深研发工程师（北京）
56,北京,技术类,2017-12-01,1,MIG15-自然语言处理高级算法研究员
57,北京,技术类,2017-11-26,1,SA-腾讯社交广告定向系统开发工程师（北京）
58,北京,技术类,2017-11-22,2,OMG236-腾讯视频自然语言处理高级工程师（北京）
59,北京,技术类,2017-11-21,1,17757-高级数据挖掘工程师（北京）
60,北京,技术类,2017-11-21,3,MIG16-地图导航惯导开发工程师（北京）
61,北京,技术类,2017-11-13,1,TEG17-AI LAB语音识别研发工程师(深圳）
62,北京,技术类,2017-11-08,1,MIG16-地图众包业务后台开发高级工程师（北京）
63,北京,技术类,2017-11-06,2,MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64,北京,技术类,2017-11-03,1,MIG16-地图POI数据挖掘高级研发工程师（北京）
65,北京,技术类,2017-11-16,1,SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66,北京,技术类,2017-11-08,1,23674-腾讯新闻后台测试组长
67,北京,技术类,2017-11-06,0,MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68,北京,技术类,2017-11-03,1,MIG16-地图POI数据自然语言处理工程师（北京）
69,北京,技术类,2017-11-02,1,MIG16-地图后台高级研发工程师-融合方向（北京）
70,北京,技术类,2017-11-01,3,MIG16-AI算法研究（北京）
71,北京,技术类,2017-11-01,1,MIG16-基础架构工程师（北京）
72,北京,技术类,2017-10-30,2,MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合感知(北京)
74,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合定位(北京)
75,北京,技术类,2017-11-01,2,MIG16-运营后台开发工程师（北京）
76,北京,技术类,2017-11-01,1,MIG16-地图大数据挖掘工程师（北京）
77,北京,技术类,2017-10-30,1,22090-天天快报-图像算法工程师（北京）
78,北京,技术类,2017-10-26,1,MIG16-自动驾驶深度学习(北京)
79,北京,技术类,2017-10-25,1,MIG16-计算机视觉高级算法工程师（北京）
80,北京,技术类,2017-09-27,1,23048-翻译君语料数据工程师（北京）
81,北京,技术类,2017-09-27,2,SA-腾讯社交广告测试开发工程师（北京）

In [25]:
df.shape  #数据结构的形状

(82, 5)

In [26]:
df.columns

Index(['work_place', 'work_type', 'work_time', 'work_count', 'work_name'], dtype='object')

In [27]:
df.dtypes

work_place    object
work_type     object
work_time     object
work_count     int64
work_name     object
dtype: object

In [28]:
df.index

RangeIndex(start=0, stop=82, step=1)

In [29]:
df.values

array([['北京', '技术类', '2017-12-20', 1, 'MIG16-位置大数据机器学习/深度学习算法研究员（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'WXG08-122 微信数据挖掘算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'OMG097-测试开发工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 2, 'OMG236-腾讯视频推荐算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, '23671-高级数据分析开发工程师(北京）'],
       ['北京', '技术类', '2017-12-20', 1, '22090-天天快报-文本分析与挖掘高级工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 1, 'WXG08-121 微信机器学习算法工程师（北京）'],
       ['北京', '技术类', '2017-12-20', 3, '23674-腾讯新闻高级系统测试工程师'],
       ['北京', '技术类', '2017-12-20', 1, 'SA-腾讯社交广告高级系统测试工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 2, '22989-腾讯云高级后台开发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 2, '22989-云计算研发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 3, '22989-腾讯云高级后台开发(互联网业务)（北京）'],
       ['北京', '技术类', '2017-12-19', 1, 'OMG097-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-18', 2, '23674-搜索架构高级工程师'],
       ['北京', '产品/项目类', '2017-12-18', 1, '22090-天天快报-数据产品组组长（北京）'],
       ['北京', '技术类', '2017-12-19', 3, 'TEG02-控制器研发工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 1, '22989-高级图像处理算法工程师（北京）'],
       ['北京', '技术类', '2017-12-19', 1, 'WXG08-121 微信模式识别自然语言处理算法工程师（北京）'],
       ['北京', '技术类', '2017-12-18', 2, '23674-新闻搜索算法高级工程师'],
       ['北京', '技术类', '2017-12-18', 1, 'OMG097-后台开发高级工程师(北京）'],
       ['北京', '技术类', '2017-12-18', 1, 'MIG03-数据评测工程师（北京）'],
       ['北京', '技术类', '2017-12-16', 2, 'OMG097-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-15', 3, 'MIG07-系统安全研究员（北京）'],
       ['北京', '技术类', '2017-12-15', 1, 'SA-腾讯社交广告联盟策略开发工程师（北京）'],
       ['北京', '技术类', '2017-12-14', 1, '23048-内容推荐算法高级工程师（北京）'],
       ['北京', '技术类', '2017-12-18', 1, 'MIG16-地图专题数据后台开发工程师-功能方向（北京）'],
       ['北京', '技术类', '2017-12-15', 3, 'MIG07-系统安全研究员（北京）'],
       ['北京', '技术类', '2017-12-15', 2, 'MIG16-地图数据高级后台工程师（北京）'],
       ['北京', '技术类', '2017-12-14', 1, 'TEG05-高级安全数据研究员(北京）'],
       ['北京', '技术类', '2017-12-14', 2, 'SA-腾讯社交广告算法工程师（质量研发中心 北京）'],
       ['北京', '技术类', '2017-12-13', 2, '22989-腾讯云大客户售后高级顾问（北京）'],
       ['北京', '技术类', '2017-12-13', 2, '22989-腾讯云行业架构师（北京）'],
       ['北京', '技术类', '2017-12-12', 1, 'WXG02-116 测试开发工程师'],
       ['北京', '技术类', '2017-12-11', 1, '15503-系统漏洞研究工程师（北京）'],
       ['北京', '产品/项目类', '2017-12-07', 1, '22989-腾讯云AI行业方案专家（北京）'],
       ['北京', '技术类', '2017-12-13', 2, '23674-腾讯新闻大数据分析工程师'],
       ['北京', '技术类', '2017-12-13', 1, 'MIG16-腾讯地图自然语言处理高级工程师(北京)'],
       ['北京', '技术类', '2017-12-12', 1, 'OMG236-腾讯视频搜索数据模型高级工程师(北京)'],
       ['北京', '技术类', '2017-12-11', 1, '23671-数据开发工程师（北京）'],
       ['北京', '技术类', '2017-12-06', 1, '22989-腾讯云PAAS产品中心高级后端开发（北京）'],
       ['北京', '技术类', '2017-12-06', 1, 'WXG08-121 模式识别机器学习（高级）算法工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 1, 'MIG07-企业安全运营工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 0, 'OMG097-业务运维（北京）'],
       ['北京', '技术类', '2017-12-04', 2, 'TEG11-机器翻译语料挖掘工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 1, 'TEG13-图像OCR算法工程师(北京)'],
       ['北京', '技术类', '2017-12-06', 1, 'WXG08-121 模式识别自然语言处理（高级）算法工程师（北京）'],
       ['北京', '技术类', '2017-12-05', 4, 'SNG02-自然语言处理高级研发工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 1, 'WXG08-113 微信搜索后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-12-04', 2, '22086-数据挖掘工程师(北京）'],
       ['北京', '技术类', '2017-12-02', 1, 'MIG03-腾讯地图高级算法评测工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-C++后台开发工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-分布式存储高级研发工程师（北京）'],
       ['北京', '技术类', '2017-11-27', 1, 'MIG16-地图导航后台开发工程师(北京)'],
       ['北京', '技术类', '2017-11-26', 1, '23048-翻译君后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 2, 'TEG03-高级算法研发工程师（深圳）'],
       ['北京', '技术类', '2017-12-01', 1, '22989-云存储资深研发工程师（北京）'],
       ['北京', '技术类', '2017-12-01', 1, 'MIG15-自然语言处理高级算法研究员'],
       ['北京', '技术类', '2017-11-26', 1, 'SA-腾讯社交广告定向系统开发工程师（北京）'],
       ['北京', '技术类', '2017-11-22', 2, 'OMG236-腾讯视频自然语言处理高级工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 1, '17757-高级数据挖掘工程师（北京）'],
       ['北京', '技术类', '2017-11-21', 3, 'MIG16-地图导航惯导开发工程师（北京）'],
       ['北京', '技术类', '2017-11-13', 1, 'TEG17-AI LAB语音识别研发工程师(深圳）'],
       ['北京', '技术类', '2017-11-08', 1, 'MIG16-地图众包业务后台开发高级工程师（北京）'],
       ['北京', '技术类', '2017-11-06', 2, 'MIG16-自动驾驶数据平台大数据高级系统架构师(北京)'],
       ['北京', '技术类', '2017-11-03', 1, 'MIG16-地图POI数据挖掘高级研发工程师（北京）'],
       ['北京', '技术类', '2017-11-16', 1, 'SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）'],
       ['北京', '技术类', '2017-11-08', 1, '23674-腾讯新闻后台测试组长'],
       ['北京', '技术类', '2017-11-06', 0, 'MIG16-自动驾驶数据平台高级后台开发工程师(北京)'],
       ['北京', '技术类', '2017-11-03', 1, 'MIG16-地图POI数据自然语言处理工程师（北京）'],
       ['北京', '技术类', '2017-11-02', 1, 'MIG16-地图后台高级研发工程师-融合方向（北京）'],
       ['北京', '技术类', '2017-11-01', 3, 'MIG16-AI算法研究（北京）'],
       ['北京', '技术类', '2017-11-01', 1, 'MIG16-基础架构工程师（北京）'],
       ['北京', '技术类', '2017-10-30', 2, 'MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶融合感知(北京)'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶融合定位(北京)'],
       ['北京', '技术类', '2017-11-01', 2, 'MIG16-运营后台开发工程师（北京）'],
       ['北京', '技术类', '2017-11-01', 1, 'MIG16-地图大数据挖掘工程师（北京）'],
       ['北京', '技术类', '2017-10-30', 1, '22090-天天快报-图像算法工程师（北京）'],
       ['北京', '技术类', '2017-10-26', 1, 'MIG16-自动驾驶深度学习(北京)'],
       ['北京', '技术类', '2017-10-25', 1, 'MIG16-计算机视觉高级算法工程师（北京）'],
       ['北京', '技术类', '2017-09-27', 1, '23048-翻译君语料数据工程师（北京）'],
       ['北京', '技术类', '2017-09-27', 2, 'SA-腾讯社交广告测试开发工程师（北京）']], dtype=object)

In [30]:
col = df[df.columns[4]]  #选中DataFrame一列，则为Series型数据
col

0       MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         WXG08-122 微信数据挖掘算法高级工程师（北京）
2                  OMG097-测试开发工程师（北京）
3            OMG236-腾讯视频推荐算法高级工程师（北京）
4               23671-高级数据分析开发工程师(北京）
5         22090-天天快报-文本分析与挖掘高级工程师（北京）
6           WXG08-121 微信机器学习算法工程师（北京）
7                 23674-腾讯新闻高级系统测试工程师
8              SA-腾讯社交广告高级系统测试工程师（北京）
9              22989-腾讯云高级后台开发工程师（北京）
10                 22989-云计算研发工程师（北京）
11         22989-腾讯云高级后台开发(互联网业务)（北京）
12                 OMG097-数据挖掘工程师(北京）
13                    23674-搜索架构高级工程师
14             22090-天天快报-数据产品组组长（北京）
15                 TEG02-控制器研发工程师（北京）
16              22989-高级图像处理算法工程师（北京）
17    WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18                  23674-新闻搜索算法高级工程师
19               OMG097-后台开发高级工程师(北京）
20                  MIG03-数据评测工程师（北京）
21                 OMG097-数据挖掘工程师(北京）
22                  MIG07-系统安全研究员（北京）
23             SA-腾讯社交广告联盟策略开发工程师（北京）
24              23048-内容推荐算法高级工程师（北京）
25       MIG16-地图专题数据后台开发工程师-功能方向（北京）
26                  MIG07-系统安全研究员（北京）
27              MIG16-地图数据高级后台工程师（北京）
28                TEG05-高级安全数据研究员(北京）
29          SA-腾讯社交广告算法工程师（质量研发中心 北京）
                   ...
52              MIG16-地图导航后台开发工程师(北京)
53             23048-翻译君后台开发高级工程师（北京）
54                TEG03-高级算法研发工程师（深圳）
55               22989-云存储资深研发工程师（北京）
56                MIG15-自然语言处理高级算法研究员
57             SA-腾讯社交广告定向系统开发工程师（北京）
58         OMG236-腾讯视频自然语言处理高级工程师（北京）
59                17757-高级数据挖掘工程师（北京）
60              MIG16-地图导航惯导开发工程师（北京）
61          TEG17-AI LAB语音识别研发工程师(深圳）
62          MIG16-地图众包业务后台开发高级工程师（北京）
63       MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64         MIG16-地图POI数据挖掘高级研发工程师（北京）
65       SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66                   23674-腾讯新闻后台测试组长
67        MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68         MIG16-地图POI数据自然语言处理工程师（北京）
69         MIG16-地图后台高级研发工程师-融合方向（北京）
70                   MIG16-AI算法研究（北京）
71                  MIG16-基础架构工程师（北京）
72    MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73                 MIG16-自动驾驶融合感知(北京)
74                 MIG16-自动驾驶融合定位(北京)
75                MIG16-运营后台开发工程师（北京）
76               MIG16-地图大数据挖掘工程师（北京）
77             22090-天天快报-图像算法工程师（北京）
78                 MIG16-自动驾驶深度学习(北京)
79             MIG16-计算机视觉高级算法工程师（北京）
80               23048-翻译君语料数据工程师（北京）
81               SA-腾讯社交广告测试开发工程师（北京）
Name: work_name, Length: 82, dtype: object

In [31]:
col.shape  #输出每维的长度，numpy的函数同样适用于pandas

(82,)

In [32]:
col[1:6]

1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2             OMG097-测试开发工程师（北京）
3       OMG236-腾讯视频推荐算法高级工程师（北京）
4          23671-高级数据分析开发工程师(北京）
5    22090-天天快报-文本分析与挖掘高级工程师（北京）
Name: work_name, dtype: object

In [33]:
import numpy as np
import pandas as pd


data = {'Weather': ['cold', 'hot', 'cold', 'hot',
   'cold', 'hot', 'cold'],
   'Food' : ['soup', 'soup', 'icecream', 'chocolate',
   'icecream', 'icecream', 'soup'],
   'Price' : 10 * np.random.rand(7), 'Number' : np.random.randint(1, 9 + 1, size=(7,))}
df = pd.DataFrame(data)

In [34]:
weather_group = df.groupby('Weather')  #数据聚合，按weather分组
i = 0
for name, group in weather_group:  #name为weather的名字，group为该类中的项
    i += 1
    print(i, name)
    print(group)

1 cold
       Food  Number     Price Weather
0      soup       7  5.773733    cold
2  icecream       2  1.107733    cold
4  icecream       8  3.765869    cold
6      soup       2  7.713925    cold
2 hot
        Food  Number     Price Weather
1       soup       6  8.880043     hot
3  chocolate       2  9.651222     hot
5   icecream       2  1.431367     hot

In [35]:
weather_group.first()

         Food  Number     Price
Weather
cold     soup       7  5.773733
hot      soup       6  8.880043

In [36]:
weather_group.last()

             Food  Number     Price
Weather
cold         soup       2  7.713925
hot      icecream       2  1.431367

In [37]:
weather_group.mean()

           Number     Price
Weather
cold     4.750000  4.590315
hot      3.333333  6.654211

In [38]:
wf_group = df.groupby(['Weather', 'Food'])
for name, group in wf_group:
    print(name)
    print(group)

('cold', 'icecream')
       Food  Number     Price Weather
2  icecream       2  1.107733    cold
4  icecream       8  3.765869    cold
('cold', 'soup')
   Food  Number     Price Weather
0  soup       7  5.773733    cold
6  soup       2  7.713925    cold
('hot', 'chocolate')
        Food  Number     Price Weather
3  chocolate       2  9.651222     hot
('hot', 'icecream')
       Food  Number     Price Weather
5  icecream       2  1.431367     hot
('hot', 'soup')
   Food  Number     Price Weather
1  soup       6  8.880043     hot

In [39]:
print(wf_group.agg([np.mean, np.median]))  # 通过agg()可以对数据组施加一系列的NumPy函数

                  Number            Price
                    mean median      mean    median
Weather Food
cold    icecream     5.0    5.0  2.436801  2.436801
        soup         4.5    4.5  6.743829  6.743829
hot     chocolate    2.0    2.0  9.651222  9.651222
        icecream     2.0    2.0  1.431367  1.431367
        soup         6.0    6.0  8.880043  8.880043

In [40]:
print(pd.concat([df[:3],df[3:]]))  #串联
print(df[:3].append(df[5:]))  #串联

        Food  Number     Price Weather
0       soup       7  5.773733    cold
1       soup       6  8.880043     hot
2   icecream       2  1.107733    cold
3  chocolate       2  9.651222     hot
4   icecream       8  3.765869    cold
5   icecream       2  1.431367     hot
6       soup       2  7.713925    cold
       Food  Number     Price Weather
0      soup       7  5.773733    cold
1      soup       6  8.880043     hot
2  icecream       2  1.107733    cold
5  icecream       2  1.431367     hot
6      soup       2  7.713925    cold

In [41]:
import numpy as np
import pandas as pd


print(pd.date_range('1/1/2018',periods=30,freq='D'))  #生成时间列表，周期为42天，D
print(pd.to_datetime(['20181231','1/1/2017']))  #将字符串转化为日期数据

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10', '2018-01-11', '2018-01-12',
               '2018-01-13', '2018-01-14', '2018-01-15', '2018-01-16',
               '2018-01-17', '2018-01-18', '2018-01-19', '2018-01-20',
               '2018-01-21', '2018-01-22', '2018-01-23', '2018-01-24',
               '2018-01-25', '2018-01-26', '2018-01-27', '2018-01-28',
               '2018-01-29', '2018-01-30'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2018-12-31', '2017-01-01'], dtype='datetime64[ns]', freq=None)

In [42]:
import numpy as np
import pandas as pd


data = {'Weather' : ['cold', 'hot', 'cold', 'hot',
   'cold', 'hot', 'cold'],
   'Food' : ['soup', 'soup', 'icecream', 'chocolate',
   'icecream', 'icecream', 'soup'],
   'Price' : 10 * np.random.rand(7), 'Number' : np.random.randint(1, 9 + 1, size=(7,))}
df = pd.DataFrame(data)   #根据字典创建DataFrame
print(pd.pivot_table(df,columns=['Food'],aggfunc=np.max))   #np.max不能加括号
print(pd.pivot_table(df,columns=['Food'],aggfunc=np.sum))   #np.sum不能加括号

Food    chocolate icecream     soup
Number          7        7        5
Price     8.05043  7.51706  9.67885
Weather       hot      hot      hot
Food    chocolate   icecream       soup
Number   7.000000  16.000000  12.000000
Price    8.050431  14.893623  20.473042

## Sorting and Ranking （排序）

按row或column index来排序的话，可以用sort_index方法，会返回一个新的object：

In [43]:
import numpy as np
import pandas as pd

In [44]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [45]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

在DataFrame，可以用index或其他axis来排序：

In [46]:
df = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [47]:
df.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [48]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

默认是升序，可以设置降序：

In [49]:
df.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

通过值来排序，用sort_values方法：

In [50]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

缺失值会被排在最后：

In [51]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

对于一个DataFrame，可以用一列或多列作为sort keys。这样的话，只需要把一列或多列的名字导入到sort_values即可：

In [52]:
df = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
df

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [53]:
df.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

多列排序的话，传入一个list of names：

In [54]:
df.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

ranking（排名）是给有效的数据分配数字。rank方法能用于series和DataFrame，rank方法默认会给每个group一个mean rank（平均排名）。rank 表示在这个数在原来的Series中排第几名，有相同的数，取其排名平均（默认）作为值：

In [55]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [56]:
obj.sort_values()

1   -5
5    0
4    2
3    4
6    4
0    7
2    7
dtype: int64

In [57]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

在obj中，4和4的排名是第4名和第五名，取平均得4.5。7和7的排名分别是第六名和第七名，则其排名取平均得6.5。

rank也可以根据数据被观测到的顺序来设定：

In [58]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

这里没有给0和2(指两个数字7)赋予average rank 6.5，而是给第一个看到的7（label 0）设置rank为6，第二个看到的7（label 2）设置rank为7。

也可以设置降序：

In [59]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

DataFrame 可以根据行或列来计算rank：

In [60]:
df = pd.DataFrame({'b': [4.3, 7, -3, 2],
                      'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
df

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [61]:
df.rank(axis='columns') # columns表示列与列之间的排序（即每一行里数据间的排序）

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

## Reading Text Files in Pieces（读取一部分文本）

对于一些比较大的文件，我们想要一次读取一小部分，或者每次迭代一小部分。在我们看一个比较大的文件前，先设置一下pandas中显示的数量：

In [62]:
import numpy as np
import pandas as pd

In [63]:
result = pd.read_csv('./data/tencent_hr.csv')
result

,work_place,work_type,work_time,work_count,work_name
0,北京,技术类,2017-12-20,1,MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1,北京,技术类,2017-12-20,1,WXG08-122 微信数据挖掘算法高级工程师（北京）
2,北京,技术类,2017-12-20,1,OMG097-测试开发工程师（北京）
3,北京,技术类,2017-12-20,2,OMG236-腾讯视频推荐算法高级工程师（北京）
4,北京,技术类,2017-12-20,1,23671-高级数据分析开发工程师(北京）
5,北京,技术类,2017-12-20,1,22090-天天快报-文本分析与挖掘高级工程师（北京）
6,北京,技术类,2017-12-20,1,WXG08-121 微信机器学习算法工程师（北京）
7,北京,技术类,2017-12-20,3,23674-腾讯新闻高级系统测试工程师
8,北京,技术类,2017-12-20,1,SA-腾讯社交广告高级系统测试工程师（北京）
9,北京,技术类,2017-12-19,2,22989-腾讯云高级后台开发工程师（北京）
10,北京,技术类,2017-12-19,2,22989-云计算研发工程师（北京）
11,北京,技术类,2017-12-19,3,22989-腾讯云高级后台开发(互联网业务)（北京）
12,北京,技术类,2017-12-19,1,OMG097-数据挖掘工程师(北京）
13,北京,技术类,2017-12-18,2,23674-搜索架构高级工程师
14,北京,产品/项目类,2017-12-18,1,22090-天天快报-数据产品组组长（北京）
15,北京,技术类,2017-12-19,3,TEG02-控制器研发工程师（北京）
16,北京,技术类,2017-12-19,1,22989-高级图像处理算法工程师（北京）
17,北京,技术类,2017-12-19,1,WXG08-121 微信模式识别自然语言处理算法工程师（北京）
18,北京,技术类,2017-12-18,2,23674-新闻搜索算法高级工程师
19,北京,技术类,2017-12-18,1,OMG097-后台开发高级工程师(北京）
20,北京,技术类,2017-12-18,1,MIG03-数据评测工程师（北京）
21,北京,技术类,2017-12-16,2,OMG097-数据挖掘工程师(北京）
22,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
23,北京,技术类,2017-12-15,1,SA-腾讯社交广告联盟策略开发工程师（北京）
24,北京,技术类,2017-12-14,1,23048-内容推荐算法高级工程师（北京）
25,北京,技术类,2017-12-18,1,MIG16-地图专题数据后台开发工程师-功能方向（北京）
26,北京,技术类,2017-12-15,3,MIG07-系统安全研究员（北京）
27,北京,技术类,2017-12-15,2,MIG16-地图数据高级后台工程师（北京）
28,北京,技术类,2017-12-14,1,TEG05-高级安全数据研究员(北京）
29,北京,技术类,2017-12-14,2,SA-腾讯社交广告算法工程师（质量研发中心 北京）
...,...,...,...,...,...
52,北京,技术类,2017-11-27,1,MIG16-地图导航后台开发工程师(北京)
53,北京,技术类,2017-11-26,1,23048-翻译君后台开发高级工程师（北京）
54,北京,技术类,2017-11-21,2,TEG03-高级算法研发工程师（深圳）
55,北京,技术类,2017-12-01,1,22989-云存储资深研发工程师（北京）
56,北京,技术类,2017-12-01,1,MIG15-自然语言处理高级算法研究员
57,北京,技术类,2017-11-26,1,SA-腾讯社交广告定向系统开发工程师（北京）
58,北京,技术类,2017-11-22,2,OMG236-腾讯视频自然语言处理高级工程师（北京）
59,北京,技术类,2017-11-21,1,17757-高级数据挖掘工程师（北京）
60,北京,技术类,2017-11-21,3,MIG16-地图导航惯导开发工程师（北京）
61,北京,技术类,2017-11-13,1,TEG17-AI LAB语音识别研发工程师(深圳）
62,北京,技术类,2017-11-08,1,MIG16-地图众包业务后台开发高级工程师（北京）
63,北京,技术类,2017-11-06,2,MIG16-自动驾驶数据平台大数据高级系统架构师(北京)
64,北京,技术类,2017-11-03,1,MIG16-地图POI数据挖掘高级研发工程师（北京）
65,北京,技术类,2017-11-16,1,SNG02-腾讯云汽车行业方案架构师（北京/上海/深圳）
66,北京,技术类,2017-11-08,1,23674-腾讯新闻后台测试组长
67,北京,技术类,2017-11-06,0,MIG16-自动驾驶数据平台高级后台开发工程师(北京)
68,北京,技术类,2017-11-03,1,MIG16-地图POI数据自然语言处理工程师（北京）
69,北京,技术类,2017-11-02,1,MIG16-地图后台高级研发工程师-融合方向（北京）
70,北京,技术类,2017-11-01,3,MIG16-AI算法研究（北京）
71,北京,技术类,2017-11-01,1,MIG16-基础架构工程师（北京）
72,北京,技术类,2017-10-30,2,MIG16-腾讯地图导航/步行骑行/公交后台开发工程师(北京)
73,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合感知(北京)
74,北京,技术类,2017-10-26,1,MIG16-自动驾驶融合定位(北京)
75,北京,技术类,2017-11-01,2,MIG16-运营后台开发工程师（北京）
76,北京,技术类,2017-11-01,1,MIG16-地图大数据挖掘工程师（北京）
77,北京,技术类,2017-10-30,1,22090-天天快报-图像算法工程师（北京）
78,北京,技术类,2017-10-26,1,MIG16-自动驾驶深度学习(北京)
79,北京,技术类,2017-10-25,1,MIG16-计算机视觉高级算法工程师（北京）
80,北京,技术类,2017-09-27,1,23048-翻译君语料数据工程师（北京）
81,北京,技术类,2017-09-27,2,SA-腾讯社交广告测试开发工程师（北京）

In [64]:
pd.options.display.max_rows = 10

In [65]:
result

   work_place work_type   work_time  work_count                      work_name
0          北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1          北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2          北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3          北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4          北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）
..        ...       ...         ...         ...                            ...
77         北京       技术类  2017-10-30           1         22090-天天快报-图像算法工程师（北京）
78         北京       技术类  2017-10-26           1             MIG16-自动驾驶深度学习(北京)
79         北京       技术类  2017-10-25           1         MIG16-计算机视觉高级算法工程师（北京）
80         北京       技术类  2017-09-27           1           23048-翻译君语料数据工程师（北京）
81         北京       技术类  2017-09-27           2           SA-腾讯社交广告测试开发工程师（北京）

[82 rows x 5 columns]

如果只是想要读取前几行（不读取整个文件），指定一下nrows：

In [66]:
pd.read_csv('./data/tencent_hr.csv', nrows=5)

  work_place work_type   work_time  work_count                      work_name
0         北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2         北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3         北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4         北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）

读取文件的一部分，可以指定chunksize：

In [67]:
chunker = pd.read_csv('./data/tencent_hr.csv', chunksize=1000)
chunker

pandas返回的TextParser object能让我们根据chunksize每次迭代文件的一部分。
TextParser有一个get_chunk方法，能返回任意大小的数据片段：

In [68]:
chunker.get_chunk(10)

  work_place work_type   work_time  work_count                      work_name
0         北京       技术类  2017-12-20           1  MIG16-位置大数据机器学习/深度学习算法研究员（北京）
1         北京       技术类  2017-12-20           1    WXG08-122 微信数据挖掘算法高级工程师（北京）
2         北京       技术类  2017-12-20           1             OMG097-测试开发工程师（北京）
3         北京       技术类  2017-12-20           2       OMG236-腾讯视频推荐算法高级工程师（北京）
4         北京       技术类  2017-12-20           1          23671-高级数据分析开发工程师(北京）
5         北京       技术类  2017-12-20           1    22090-天天快报-文本分析与挖掘高级工程师（北京）
6         北京       技术类  2017-12-20           1      WXG08-121 微信机器学习算法工程师（北京）
7         北京       技术类  2017-12-20           3            23674-腾讯新闻高级系统测试工程师
8         北京       技术类  2017-12-20           1         SA-腾讯社交广告高级系统测试工程师（北京）
9         北京       技术类  2017-12-19           2         22989-腾讯云高级后台开发工程师（北京）

## Handling Missing Data

In [69]:
import pandas as pd
import numpy as np

In [70]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [71]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [72]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [73]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

对于DataFrame，会复杂一些。你可能想要删除包含有NA的row和column。dropna默认会删除包含有缺失值的row：

In [74]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [75]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

设定how=all只会删除那些全是NA的行：

In [76]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [77]:
data[3] = np.nan
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [78]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [79]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.434972  0.921002  1.113341
1 -0.775356 -0.210724  0.333339
2 -0.416249 -0.228019 -0.252413
3 -0.210916 -0.425211 -2.669185
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

In [80]:
df.iloc[:4, 1] = np.nan
df

          0         1         2
0  0.434972       NaN  1.113341
1 -0.775356       NaN  0.333339
2 -0.416249       NaN -0.252413
3 -0.210916       NaN -2.669185
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

In [81]:
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.434972       NaN       NaN
1 -0.775356       NaN       NaN
2 -0.416249       NaN -0.252413
3 -0.210916       NaN -2.669185
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

In [82]:
df.dropna()

          0         1         2
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

In [83]:
df.dropna(thresh=2)  # 在一行中至少有2个非 NA 值时将其保留

          0         1         2
2 -0.416249       NaN -0.252413
3 -0.210916       NaN -2.669185
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

不是删除缺失值，而是用一些数字填补。对于大部分目的，fillna是可以用的。调用fillna的时候设置好一个常用用来替换缺失值：

In [84]:
df.fillna(0)

          0         1         2
0  0.434972  0.000000  0.000000
1 -0.775356  0.000000  0.000000
2 -0.416249  0.000000 -0.252413
3 -0.210916  0.000000 -2.669185
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

给fillna传入一个dict，可以给不同列替换不同的值：

In [85]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.434972  0.500000  0.000000
1 -0.775356  0.500000  0.000000
2 -0.416249  0.500000 -0.252413
3 -0.210916  0.500000 -2.669185
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

fillna返回一个新对象，但你可以使用inplace来直接更改原有的数据：

In [86]:
df.fillna(0, inplace=True)
df

          0         1         2
0  0.434972  0.000000  0.000000
1 -0.775356  0.000000  0.000000
2 -0.416249  0.000000 -0.252413
3 -0.210916  0.000000 -2.669185
4 -1.481066 -0.010886  0.221251
5 -1.175749 -0.025502  1.005389
6 -2.145494  0.868830 -0.857253

## Data Transformation（数据变换）

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

DataFrame方法duplicated返回的是一个boolean Series，表示一个row是否是重复的（根据前一行来判断）：

In [3]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

drop_duplicateds返回一个DataFrame，会删除重复的部分：

In [4]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

上面两种方法都默认考虑所有列；另外，我们可以指定一部分来检测重复值。假设我们只想检测'k1'列的重复值：

In [5]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

duplicated和drop_duplicated默认保留第一次观测到的数值组合。设置keep='last'能返回最后一个：

In [7]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [8]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

假设你想加一列，表明每种肉来源的动物是什么。我们可以写一个映射：

In [9]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

用于series的map方法接受一个函数，或是一个字典，包含着映射关系，但这里有一个小问题，有些肉是大写，有些是小写。因此，我们先用str.lower把所有的值变为小写：

In [10]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [11]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

我们也可以用一个函数解决上面的问题：

In [12]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

使用map是一个很简便的方法，用于element-wise转换和其他一些数据清洗操作。

其实fillna是一个特殊的替换操作，map可以用于修改一个object里的部分值，但是replace能提供一个更简单和更灵活的方法做到这点。

In [13]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [14]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

如果想要一次替换多个值，直接用一个list即可：

In [15]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

对于不同的值用不同的替换值，也是使用一个list：

In [16]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

参数也可以是一个dict：

In [17]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

注意：data.replace方法和data.str.replace方法是不同的，后者会对string进行element-wise替换。

In [18]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [19]:
data.index.map(lambda x: x[:4].upper())

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [20]:
data.index = data.index.map(lambda x: x[:4].upper())
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

如果你想要创建一个转换后的版本，而且不用修改原始的数据，可以用rename：

In [21]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [22]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'pekaboo'})

         one  two  pekaboo  four
INDIANA    0    1        2     3
COLO       4    5        6     7
NEW        8    9       10    11

In [23]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

连续型数据经常被离散化或分散成bins（分箱）来分析。假设你有一组数据，你想把人分到不同的年龄组里：

In [24]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

我们把这些分到四个bin里，19~25，26~35，36~60，>60。可以用pandas里的cut：

In [25]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

返回的是一个特殊的Categorical object。我们看到的结果描述了pandas.cut如何得到bins。可以看作是一个string数组用来表示bin的名字，它内部包含了一个categories数组，用来记录不同类别的名字，并伴有表示ages的label（可以通过codes属性查看）：

In [26]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [27]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [28]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

这里pd.value_counts(cats)是pandas.cut后bin的数量。

这里我们注意一下区间。括号表示不包含，方括号表示包含。你可以自己设定哪一边关闭（right=False）：

In [29]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

你也可以用一个list或数组给labels选项来设定bin的名字：

In [30]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [31]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

如果你只是给一个bins的数量来cut，而不是自己设定每个bind的范围，cut会根据最大值和最小值来计算等长的bins。比如下面我们想要做一个均匀分布的四个bins：

In [32]:
data = np.random.rand(20)
data

array([ 0.54115494,  0.27825248,  0.23037718,  0.46402921,  0.09044504,
        0.53411552,  0.7643163 ,  0.56834291,  0.92170231,  0.21163758,
        0.90521806,  0.58288798,  0.32270843,  0.65515972,  0.65807951,
        0.84489871,  0.47216131,  0.35083809,  0.78169546,  0.95303777])

In [33]:
pd.cut(data, 4, precision=2)

[(0.52, 0.74], (0.09, 0.31], (0.09, 0.31], (0.31, 0.52], (0.09, 0.31], ..., (0.74, 0.95], (0.31, 0.52], (0.31, 0.52], (0.74, 0.95], (0.74, 0.95]]
Length: 20
Categories (4, interval[float64]): [(0.09, 0.31] < (0.31, 0.52] < (0.52, 0.74] < (0.74, 0.95]]

precision=2选项表示精确到小数点后两位。

一个近似的函数，qcut，会按照数据的分位数来分箱。取决于数据的分布，用cut通常不能保证每一个bin有一个相同数量的数据点。而qcut是按百分比来切的，所以可以得到等数量的bins：

In [34]:
data = np.random.randn(1000) # Normally distributed

In [35]:
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(0.677, 3.652], (0.0159, 0.677], (0.0159, 0.677], (0.0159, 0.677], (-3.625, -0.639], ..., (0.0159, 0.677], (0.0159, 0.677], (-0.639, 0.0159], (0.0159, 0.677], (-3.625, -0.639]]
Length: 1000
Categories (4, interval[float64]): [(-3.625, -0.639] < (-0.639, 0.0159] < (0.0159, 0.677] < (0.677, 3.652]]

In [40]:
pd.value_counts(cats)

(0.677, 3.652]      250
(0.0159, 0.677]     250
(-0.639, 0.0159]    250
(-3.625, -0.639]    250
dtype: int64

类似的，在cut中我们可以自己指定百分比：

In [41]:
cats2 = pd.cut(data, [0, 0.1, 0.5, 0.9, 1.]) # 累计的百分比
cats2

[NaN, (0.1, 0.5], (0.1, 0.5], (0.1, 0.5], NaN, ..., (0.5, 0.9], (0.1, 0.5], NaN, (0.1, 0.5], NaN]
Length: 1000
Categories (4, interval[float64]): [(0.0, 0.1] < (0.1, 0.5] < (0.5, 0.9] < (0.9, 1.0]]

In [42]:
pd.value_counts(cats2)

(0.1, 0.5]    152
(0.5, 0.9]    125
(0.0, 0.1]     43
(0.9, 1.0]     28
dtype: int64

过滤或转换异常值是数组操作的一个重头戏。

In [44]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.015790     0.019407     0.047804    -0.053997
std       0.985078     0.979832     0.976589     1.016512
min      -3.939409    -3.281035    -2.913962    -2.990414
25%      -0.621256    -0.643842    -0.613474    -0.808399
50%       0.003907     0.004917     0.056509    -0.076435
75%       0.663649     0.704465     0.722828     0.617521
max       2.933417     3.189148     3.230195     3.183051

假设我们想要找一个列中，绝对值大于3的数字：

In [45]:
col = data[2]
col.head()

0   -1.565680
1    0.492903
2   -0.708070
3    1.805304
4    0.063137
Name: 2, dtype: float64

In [46]:
col[np.abs(col) > 3]

141    3.230195
349    3.176024
Name: 2, dtype: float64

选中所有绝对值大于3的行，可以用any方法在一个boolean DataFrame上：

In [47]:
data[(np.abs(data) > 3).any(1)] # any中axis=1表示column

            0         1         2         3
99   0.702778 -3.036095  0.340688  0.501693
141  0.292360 -0.286770  3.230195 -0.904579
200 -3.068429  0.502610 -0.667065  1.354711
349 -1.220703 -1.043828  3.176024 -1.289045
373 -3.939409  0.752446 -0.899657 -1.265130
552 -3.393450 -1.523242 -0.475046  1.106799
769  0.949808  3.115082  0.214810  0.522246
819 -2.602738 -3.281035 -2.335078 -2.943746
875 -0.011086  3.189148  0.186665 -0.632416
879  1.420344  0.924610 -0.963256  3.183051

下面是把绝对值大于3的数字直接变成-3或3：

In [48]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [49]:
data[98:100]

           0         1         2         3
98 -1.436895 -1.508486  0.613444  0.000251
99  0.702778 -3.000000  0.340688  0.501693

In [50]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017191     0.019420     0.047397    -0.054180
std       0.980241     0.977860     0.975316     1.015945
min      -3.000000    -3.000000    -2.913962    -2.990414
25%      -0.621256    -0.643842    -0.613474    -0.808399
50%       0.003907     0.004917     0.056509    -0.076435
75%       0.663649     0.704465     0.722828     0.617521
max       2.933417     3.000000     3.000000     3.000000

np.sign(data)会根据值的正负号来得到1或-1：

In [51]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2 -1.0  1.0 -1.0  1.0
3 -1.0  1.0  1.0  1.0
4  1.0  1.0  1.0 -1.0

排列（随机排序）一个series或DataFrame中的row，用numpy.random.permutation函数很容易就能做到。调用permutation的时候设定好你想要进行排列的axis，会产生一个整数数组表示新的顺序：

In [52]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [53]:
sampler = np.random.permutation(5)
sampler

array([0, 3, 2, 1, 4])

这个数组能被用在基于iloc上的indexing或take函数：

In [54]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

为了选中一个随机的子集，而且没有代替功能(既不影响原来的值，返回一个新的series或DataFrame)，可以用sample方法：

In [55]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

如果想要生成的样本带有替代功能(即允许重复)，给sample中设定replace=True：

In [56]:
choices = pd.Series([5, 7, -1, 6, 4])

draws = choices.sample(n=10, replace=True)

draws

3    6
4    4
3    6
2   -1
1    7
2   -1
2   -1
0    5
2   -1
1    7
dtype: int64

Dummy Variables：虚拟变量，又称虚设变量、名义变量或哑变量,用以反映质的属性的一个人工变量,是量化了的自变量,通常取值为0或1。

另一种在统计模型上的转换或机器学习应用是把一个categorical variable(类别变量)变为一个dummy or indicator matrix（虚拟或指示器矩阵）。如果DataFrame中的一列有k个不同的值，我们可以用一个矩阵或DataFrame用k列来表示，1或0。pandas有一个get_dummies函数实现这个工作，当然，你自己设计一个其实也不难。这里举个例子：

In [57]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [58]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

在一些情况里，如果我们想要给column加一个prefix， 可以用data.get_dummies里的prefix参数来实现：

In [59]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [60]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0